# 子弹类型
weaponAmmoTypes = [
    ("默认", -1),
    ("MKⅡ爆炸子弹", 18),
    ("信号弹", 22),
    ("燃油泵", 34),
    ("原子能枪", 70),
]
# 载具
vehicles = [
    ("801巴提", "Bati"),
    ("骷髅马", "Kuruma2"),
    ("阿库拉", "Akula"),
    ("长崎小艇", "Dinghy2"),
    ("图拉尔多", "Toreador"),
    ("狂焰", "Pyro"),
    ("P-996 天煞", "Lazer"),
    ("暴君MK2", "Oppressor2"),
]
# 战局
sessions = [
    ("仅限邀请战局", 11),
    ("创建公共战局", 1),
    ("私人好友战局", 6),
    ("单人战局", 10),
    ("离开线上", -1),
]
# 天气
weather = [
    ("默认", -1),
    ("格外晴朗", 0),
    ("晴朗", 1),
    ("多云", 2),
    ("阴霾", 3),
    ("大雾", 4),
    ("阴天", 5),
    ("下雨", 6),
    ("雷雨", 7),
    ("雨转晴", 8),
    ("阴雨", 9),
    ("下雪", 10),
    ("暴雪", 11),
    ("小雪", 12),
    ("圣诞", 13),
    ("万圣节", 14),
]
# 载具能力
vehicleAbilities = [("普通载具能力", 0x0), ("载具助推器", 0x40), ("载具跳跃", 0x20)]
